; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=354, out_folder=./training, instance_id=78, seed=2102, goal_proportion=0.03

(define (problem blocksworld-78)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 - object)
 (:init 
    (arm-empty)
    (clear b338)
    (on b338 b241)
    (on b241 b6)
    (on b6 b30)
    (on b30 b127)
    (on b127 b4)
    (on b4 b16)
    (on b16 b311)
    (on b311 b87)
    (on b87 b60)
    (on b60 b354)
    (on b354 b292)
    (on b292 b346)
    (on b346 b84)
    (on b84 b261)
    (on-table b261)
    (clear b206)
    (on b206 b259)
    (on-table b259)
    (clear b238)
    (on b238 b104)
    (on-table b104)
    (clear b129)
    (on b129 b15)
    (on b15 b160)
    (on b160 b313)
    (on-table b313)
    (clear b81)
    (on b81 b254)
    (on-table b254)
    (clear b258)
    (on b258 b307)
    (on b307 b115)
    (on-table b115)
    (clear b213)
    (on b213 b334)
    (on b334 b148)
    (on-table b148)
    (clear b20)
    (on b20 b271)
    (on b271 b198)
    (on b198 b229)
    (on b229 b55)
    (on b55 b300)
    (on b300 b106)
    (on b106 b164)
    (on b164 b141)
    (on b141 b233)
    (on b233 b123)
    (on b123 b165)
    (on b165 b319)
    (on-table b319)
    (clear b26)
    (on b26 b156)
    (on b156 b324)
    (on b324 b260)
    (on b260 b235)
    (on b235 b230)
    (on b230 b124)
    (on b124 b134)
    (on b134 b286)
    (on b286 b147)
    (on b147 b264)
    (on b264 b177)
    (on b177 b101)
    (on b101 b17)
    (on b17 b255)
    (on b255 b305)
    (on-table b305)
    (clear b5)
    (on b5 b24)
    (on b24 b131)
    (on b131 b252)
    (on b252 b274)
    (on b274 b210)
    (on-table b210)
    (clear b306)
    (on b306 b212)
    (on-table b212)
    (clear b194)
    (on b194 b183)
    (on b183 b280)
    (on b280 b175)
    (on b175 b40)
    (on-table b40)
    (clear b73)
    (on b73 b48)
    (on b48 b67)
    (on-table b67)
    (clear b150)
    (on-table b150)
    (clear b327)
    (on b327 b118)
    (on b118 b345)
    (on-table b345)
    (clear b74)
    (on-table b74)
    (clear b163)
    (on b163 b107)
    (on-table b107)
    (clear b201)
    (on b201 b143)
    (on-table b143)
    (clear b284)
    (on b284 b332)
    (on b332 b291)
    (on-table b291)
    (clear b8)
    (on b8 b168)
    (on-table b168)
    (clear b169)
    (on-table b169)
    (clear b344)
    (on b344 b303)
    (on b303 b137)
    (on-table b137)
    (clear b195)
    (on b195 b200)
    (on b200 b13)
    (on b13 b176)
    (on b176 b248)
    (on b248 b32)
    (on b32 b207)
    (on b207 b152)
    (on b152 b272)
    (on-table b272)
    (clear b149)
    (on b149 b59)
    (on-table b59)
    (clear b329)
    (on-table b329)
    (clear b95)
    (on b95 b180)
    (on-table b180)
    (clear b22)
    (on-table b22)
    (clear b282)
    (on b282 b68)
    (on b68 b92)
    (on b92 b320)
    (on b320 b309)
    (on b309 b133)
    (on b133 b191)
    (on b191 b312)
    (on b312 b247)
    (on b247 b232)
    (on-table b232)
    (clear b54)
    (on b54 b72)
    (on b72 b189)
    (on b189 b82)
    (on b82 b322)
    (on-table b322)
    (clear b96)
    (on b96 b3)
    (on-table b3)
    (clear b197)
    (on b197 b102)
    (on-table b102)
    (clear b347)
    (on b347 b34)
    (on b34 b185)
    (on b185 b128)
    (on b128 b174)
    (on b174 b351)
    (on b351 b337)
    (on b337 b211)
    (on b211 b325)
    (on b325 b41)
    (on-table b41)
    (clear b90)
    (on b90 b61)
    (on b61 b208)
    (on b208 b146)
    (on-table b146)
    (clear b242)
    (on b242 b236)
    (on b236 b162)
    (on b162 b301)
    (on b301 b186)
    (on-table b186)
    (clear b170)
    (on b170 b299)
    (on-table b299)
    (clear b308)
    (on b308 b315)
    (on b315 b151)
    (on b151 b182)
    (on b182 b223)
    (on b223 b265)
    (on b265 b144)
    (on-table b144)
    (clear b196)
    (on b196 b139)
    (on-table b139)
    (clear b239)
    (on-table b239)
    (clear b44)
    (on-table b44)
    (clear b318)
    (on b318 b187)
    (on-table b187)
    (clear b192)
    (on b192 b321)
    (on b321 b117)
    (on b117 b221)
    (on b221 b18)
    (on b18 b193)
    (on b193 b250)
    (on-table b250)
    (clear b277)
    (on b277 b31)
    (on b31 b330)
    (on b330 b281)
    (on b281 b350)
    (on-table b350)
    (clear b28)
    (on-table b28)
    (clear b65)
    (on b65 b7)
    (on b7 b263)
    (on b263 b9)
    (on b9 b51)
    (on-table b51)
    (clear b29)
    (on b29 b323)
    (on b323 b112)
    (on b112 b103)
    (on b103 b113)
    (on b113 b251)
    (on b251 b86)
    (on b86 b290)
    (on b290 b94)
    (on b94 b253)
    (on b253 b56)
    (on b56 b39)
    (on b39 b157)
    (on b157 b80)
    (on b80 b178)
    (on-table b178)
    (clear b225)
    (on b225 b136)
    (on b136 b245)
    (on-table b245)
    (clear b172)
    (on b172 b38)
    (on b38 b216)
    (on b216 b63)
    (on b63 b109)
    (on-table b109)
    (clear b46)
    (on b46 b45)
    (on-table b45)
    (clear b190)
    (on b190 b93)
    (on b93 b2)
    (on b2 b217)
    (on b217 b181)
    (on b181 b293)
    (on b293 b167)
    (on b167 b296)
    (on b296 b100)
    (on-table b100)
    (clear b135)
    (on b135 b228)
    (on b228 b11)
    (on b11 b57)
    (on b57 b353)
    (on b353 b266)
    (on-table b266)
    (clear b279)
    (on b279 b21)
    (on b21 b64)
    (on b64 b220)
    (on b220 b111)
    (on b111 b297)
    (on-table b297)
    (clear b140)
    (on b140 b285)
    (on b285 b302)
    (on b302 b120)
    (on b120 b188)
    (on b188 b341)
    (on-table b341)
    (clear b342)
    (on-table b342)
    (clear b298)
    (on b298 b62)
    (on b62 b50)
    (on b50 b122)
    (on b122 b88)
    (on b88 b202)
    (on b202 b317)
    (on b317 b203)
    (on-table b203)
    (clear b23)
    (on b23 b184)
    (on b184 b153)
    (on b153 b108)
    (on-table b108)
    (clear b10)
    (on-table b10)
    (clear b304)
    (on b304 b1)
    (on-table b1)
    (clear b226)
    (on-table b226)
    (clear b219)
    (on b219 b76)
    (on b76 b214)
    (on-table b214)
    (clear b25)
    (on b25 b278)
    (on b278 b333)
    (on b333 b289)
    (on b289 b27)
    (on b27 b99)
    (on b99 b126)
    (on-table b126)
    (clear b142)
    (on b142 b215)
    (on-table b215)
    (clear b77)
    (on b77 b224)
    (on-table b224)
    (clear b287)
    (on b287 b205)
    (on-table b205)
    (clear b89)
    (on-table b89)
    (clear b155)
    (on b155 b47)
    (on b47 b348)
    (on-table b348)
    (clear b204)
    (on b204 b125)
    (on b125 b78)
    (on b78 b288)
    (on b288 b339)
    (on b339 b335)
    (on b335 b71)
    (on b71 b132)
    (on b132 b231)
    (on-table b231)
    (clear b336)
    (on-table b336)
    (clear b352)
    (on b352 b349)
    (on b349 b105)
    (on b105 b97)
    (on b97 b130)
    (on b130 b179)
    (on-table b179)
    (clear b58)
    (on b58 b33)
    (on b33 b145)
    (on b145 b49)
    (on b49 b275)
    (on-table b275)
    (clear b256)
    (on b256 b328)
    (on b328 b166)
    (on-table b166)
    (clear b244)
    (on b244 b69)
    (on b69 b276)
    (on-table b276)
    (clear b314)
    (on b314 b269)
    (on b269 b283)
    (on b283 b243)
    (on b243 b98)
    (on b98 b171)
    (on b171 b310)
    (on-table b310)
    (clear b83)
    (on b83 b267)
    (on b267 b273)
    (on b273 b343)
    (on b343 b35)
    (on b35 b340)
    (on b340 b79)
    (on b79 b222)
    (on b222 b66)
    (on b66 b161)
    (on b161 b295)
    (on b295 b262)
    (on b262 b91)
    (on-table b91)
    (clear b114)
    (on-table b114)
    (clear b159)
    (on b159 b37)
    (on-table b37)
    (clear b234)
    (on-table b234)
    (clear b14)
    (on b14 b138)
    (on-table b138)
    (clear b268)
    (on b268 b110)
    (on-table b110)
    (clear b119)
    (on b119 b246)
    (on b246 b43)
    (on b43 b70)
    (on-table b70)
    (clear b75)
    (on b75 b249)
    (on b249 b237)
    (on b237 b173)
    (on b173 b19)
    (on b19 b36)
    (on b36 b209)
    (on b209 b199)
    (on b199 b116)
    (on b116 b12)
    (on-table b12)
    (clear b121)
    (on-table b121)
    (clear b316)
    (on b316 b326)
    (on b326 b52)
    (on b52 b85)
    (on b85 b42)
    (on b42 b218)
    (on-table b218)
    (clear b227)
    (on b227 b331)
    (on b331 b270)
    (on b270 b294)
    (on b294 b158)
    (on-table b158)
    (clear b240)
    (on b240 b53)
    (on b53 b257)
    (on b257 b154)
    (on-table b154))
 (:goal  (and 
    (clear b1)
    (on b1 b2)
    (on-table b2)
    (clear b9)
    (on b9 b10)
    (on b10 b7)
    (on b7 b3)
    (on b3 b6)
    (on b6 b8)
    (on b8 b5)
    (on b5 b4)
    (on-table b4))))

; plan
1. (unstack b190 b93)
   deleted: (on b190 b93) (clear b190) (arm-empty)
   added: (holding b190) (clear b93)
   goals met: 0 of 12
2. (putdown b190)
   deleted: (holding b190)
   added: (clear b190) (arm-empty) (on-table b190)
   goals met: 0 of 12
3. (unstack b304 b1)
   deleted: (on b304 b1) (clear b304) (arm-empty)
   added: (holding b304) (clear b1)
   goals met: 1 of 12
4. (putdown b304)
   deleted: (holding b304)
   added: (clear b304) (arm-empty) (on-table b304)
   goals met: 1 of 12
5. (unstack b338 b241)
   deleted: (on b338 b241) (clear b338) (arm-empty)
   added: (holding b338) (clear b241)
   goals met: 1 of 12
6. (putdown b338)
   deleted: (holding b338)
   added: (clear b338) (arm-empty) (on-table b338)
   goals met: 1 of 12
7. (unstack b241 b6)
   deleted: (on b241 b6) (clear b241) (arm-empty)
   added: (holding b241) (clear b6)
   goals met: 1 of 12
8. (putdown b241)
   deleted: (holding b241)
   added: (clear b241) (arm-empty) (on-table b241)
   goals met: 1 of 12
9. (unstack b65 b7)
   deleted: (on b65 b7) (clear b65) (arm-empty)
   added: (holding b65) (clear b7)
   goals met: 1 of 12
10. (putdown b65)
   deleted: (holding b65)
   added: (clear b65) (arm-empty) (on-table b65)
   goals met: 1 of 12
11. (unstack b93 b2)
   deleted: (on b93 b2) (clear b93) (arm-empty)
   added: (holding b93) (clear b2)
   goals met: 1 of 12
12. (putdown b93)
   deleted: (holding b93)
   added: (clear b93) (arm-empty) (on-table b93)
   goals met: 1 of 12
13. (unstack b2 b217)
   deleted: (on b2 b217) (clear b2) (arm-empty)
   added: (holding b2) (clear b217)
   goals met: 1 of 12
14. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 2 of 12
15. (unstack b96 b3)
   deleted: (on b96 b3) (clear b96) (arm-empty)
   added: (holding b96) (clear b3)
   goals met: 2 of 12
16. (putdown b96)
   deleted: (holding b96)
   added: (clear b96) (arm-empty) (on-table b96)
   goals met: 2 of 12
17. (unstack b6 b30)
   deleted: (on b6 b30) (clear b6) (arm-empty)
   added: (holding b6) (clear b30)
   goals met: 2 of 12
18. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 12
19. (unstack b30 b127)
   deleted: (on b30 b127) (clear b30) (arm-empty)
   added: (holding b30) (clear b127)
   goals met: 2 of 12
20. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 2 of 12
21. (unstack b127 b4)
   deleted: (on b127 b4) (clear b127) (arm-empty)
   added: (holding b127) (clear b4)
   goals met: 2 of 12
22. (putdown b127)
   deleted: (holding b127)
   added: (clear b127) (arm-empty) (on-table b127)
   goals met: 2 of 12
23. (unstack b4 b16)
   deleted: (on b4 b16) (clear b4) (arm-empty)
   added: (holding b4) (clear b16)
   goals met: 2 of 12
24. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 3 of 12
25. (unstack b7 b263)
   deleted: (on b7 b263) (clear b7) (arm-empty)
   added: (holding b7) (clear b263)
   goals met: 3 of 12
26. (stack b7 b3)
   deleted: (clear b3) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b3)
   goals met: 4 of 12
27. (unstack b263 b9)
   deleted: (on b263 b9) (clear b263) (arm-empty)
   added: (holding b263) (clear b9)
   goals met: 5 of 12
28. (putdown b263)
   deleted: (holding b263)
   added: (clear b263) (arm-empty) (on-table b263)
   goals met: 5 of 12
29. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 5 of 12
30. (stack b10 b7)
   deleted: (clear b7) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b7)
   goals met: 6 of 12
31. (unstack b5 b24)
   deleted: (on b5 b24) (clear b5) (arm-empty)
   added: (holding b5) (clear b24)
   goals met: 6 of 12
32. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 7 of 12
33. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 7 of 12
34. (stack b6 b8)
   deleted: (clear b8) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b8)
   goals met: 8 of 12
35. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 7 of 12
36. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 9 of 12
37. (unstack b9 b51)
   deleted: (on b9 b51) (clear b9) (arm-empty)
   added: (holding b9) (clear b51)
   goals met: 8 of 12
38. (stack b9 b10)
   deleted: (clear b10) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b10)
   goals met: 10 of 12
39. (unstack b6 b8)
   deleted: (on b6 b8) (clear b6) (arm-empty)
   added: (holding b6) (clear b8)
   goals met: 9 of 12
40. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 9 of 12
41. (unstack b8 b168)
   deleted: (on b8 b168) (clear b8) (arm-empty)
   added: (holding b8) (clear b168)
   goals met: 9 of 12
42. (stack b8 b5)
   deleted: (clear b5) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b5)
   goals met: 10 of 12
43. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 10 of 12
44. (stack b6 b8)
   deleted: (clear b8) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b8)
   goals met: 11 of 12
45. (unstack b9 b10)
   deleted: (on b9 b10) (clear b9) (arm-empty)
   added: (holding b9) (clear b10)
   goals met: 9 of 12
46. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 10 of 12
47. (unstack b10 b7)
   deleted: (on b10 b7) (clear b10) (arm-empty)
   added: (holding b10) (clear b7)
   goals met: 9 of 12
48. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 9 of 12
49. (unstack b7 b3)
   deleted: (on b7 b3) (clear b7) (arm-empty)
   added: (holding b7) (clear b3)
   goals met: 8 of 12
50. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 8 of 12
51. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 8 of 12
52. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 9 of 12
53. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 9 of 12
54. (stack b7 b3)
   deleted: (clear b3) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b3)
   goals met: 10 of 12
55. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 10 of 12
56. (stack b10 b7)
   deleted: (clear b7) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b7)
   goals met: 11 of 12
57. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 10 of 12
58. (stack b9 b10)
   deleted: (clear b10) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b10)
   goals met: 12 of 12
